{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 56], "sparse": false, "name": "input_1", "dtype": "int32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Embedding", "config": {"batch_input_shape": [null, 56], "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "trainable": true, "name": "embedding_1", "mask_zero": false, "embeddings_regularizer": null, "input_length": 56, "dtype": "float32", "output_dim": 256, "input_dim": 18765, "embeddings_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "Reshape", "config": {"target_shape": [56, 256, 1], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_size": [3, 256], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "bias_constraint": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_2", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_size": [4, 256], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "bias_constraint": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_3", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "kernel_size": [5, 256], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "bias_constraint": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [1, 1], "trainable": true, "padding": "valid", "pool_size": [54, 1]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [1, 1], "trainable": true, "padding": "valid", "pool_size": [53, 1]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "strides": [1, 1], "trainable": true, "padding": "valid", "pool_size": [52, 1]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"class_name": "Concatenate", "config": {"axis": 1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_1", "use_bias": true, "units": 2, "activation": "softmax", "kernel_constraint": null, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}}