{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "dtype": "int32", "sparse": false, "batch_input_shape": [null, 56]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"activity_regularizer": null, "dtype": "float32", "embeddings_regularizer": null, "output_dim": 256, "trainable": true, "input_dim": 18765, "mask_zero": false, "batch_input_shape": [null, 56], "input_length": 56, "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_constraint": null}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "reshape_1", "config": {"name": "reshape_1", "target_shape": [56, 256, 1], "trainable": true}, "class_name": "Reshape", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "conv2d_1", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "name": "conv2d_1", "strides": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 512, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 256]}, "class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "name": "conv2d_2", "strides": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 512, "activation": "relu", "data_format": "channels_last", "kernel_size": [4, 256]}, "class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "name": "conv2d_3", "strides": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 512, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 256]}, "class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "strides": [1, 1], "pool_size": [54, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "strides": [1, 1], "pool_size": [53, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "strides": [1, 1], "pool_size": [52, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "axis": 1, "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"rate": 0.5, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 2, "trainable": true, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax"}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.1.6"}