{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.6", "config": {"output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 56], "dtype": "int32", "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "embedding_1", "config": {"batch_input_shape": [null, 56], "activity_regularizer": null, "name": "embedding_1", "trainable": true, "input_dim": 18765, "mask_zero": false, "embeddings_regularizer": null, "embeddings_constraint": null, "dtype": "float32", "input_length": 56, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "output_dim": 256}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"target_shape": [56, 256, 1], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"bias_constraint": null, "padding": "valid", "activation": "relu", "activity_regularizer": null, "name": "conv2d_1", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "kernel_size": [3, 256]}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"bias_constraint": null, "padding": "valid", "activation": "relu", "activity_regularizer": null, "name": "conv2d_2", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "kernel_size": [4, 256]}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"bias_constraint": null, "padding": "valid", "activation": "relu", "activity_regularizer": null, "name": "conv2d_3", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0}}, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "kernel_size": [5, 256]}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [54, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [53, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"padding": "valid", "name": "max_pooling2d_3", "pool_size": [52, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": 1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"units": 2, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}}